Output of `make plan`:
```
Terraform will perform the following actions:

  # module.quasar.aws_directory_service_directory.vpn-ad will be created
  + resource "aws_directory_service_directory" "vpn-ad" {
      + access_url        = (known after apply)
      + alias             = (known after apply)
      + dns_ip_addresses  = (known after apply)
      + edition           = "Standard"
      + enable_sso        = false
      + id                = (known after apply)
      + name              = "ad.d12g.co"
      + password          = (sensitive value)
      + security_group_id = (known after apply)
      + short_name        = (known after apply)
      + size              = (known after apply)
      + type              = "MicrosoftAD"

      + vpc_settings {
          + subnet_ids = [
              + "subnet-165c315f",
              + "subnet-be42f093",
            ]
          + vpc_id     = "vpc-4e8dc229"
        }
    }

  # module.quasar.random_string.admin_password will be created
  + resource "random_string" "admin_password" {
      + id               = (known after apply)
      + length           = 24
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "!#%&*()-_=+[]{}<>:?"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```